zuorasoap/zuorasoap-connector/zuorasoap-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/zuorasoap/esbDeleteMandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.zuora">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
        <urn:username>%s(username)</urn:username>
        <urn:password>%s(password)</urn:password>
        <urn:method>delete</urn:method>
        <urn:zobjectType>Account</urn:zobjectType>
        <urn1:zObjects xmlns:urn1="http://api.zuora.com/">
            <Ids>%s(id)</Ids>
        </urn1:zObjects>
    </soapenv:Body>
</soapenv:Envelope>